export default {
	"WC": [
	//: 西历元旦、纪念日参考《全国年节及纪念日放假办法》（西元2024年第四次修订版）
		[1949, 1, 1, "西历元旦", "", " "],
		[1924, 2, 7, "二七纪念日"],
		[1926, 5,30, "五卅纪念日"],
		[2003, 6, 7, "普通高等学校招生全国统一考试", "", "✍"],
		[2003, 6, 8, "普通高等学校招生全国统一考试", "", "✍"],
		[1946, 7, 7, "七七抗战纪念日"],
		[1979, 7, 7, "普通高等学校招生全国统一考试", 2002, "✍"],
		[1979, 7, 8, "普通高等学校招生全国统一考试", 2002, "✍"],
		[1979, 7, 9, "普通高等学校招生全国统一考试", 2002, "✍"],
		[1946, 9, 3, "九三抗战胜利纪念日"],
		[1946, 9,18, "九一八纪念日"]
	],
	"JL": [
	],
	"JQ": [
	],
	"AL": [
	]
};
