export default {
	"JQ": [ //: 缺省起行年：太初元年
		[2063, 0, 105, ["寒食节", "寒食节"], 3656],
		[3657, 7,-2, ["寒食节", "寒食节"], 4341],
		[4342, 7,-1, ["寒食节", "寒食节"]],
		[3657, 7, 0, ["清明节", "清明节"]], // 且由北宋起兴
		[ 1,24, 0, ["冬至", "冬至"]]
	],
	"AL": [ //: 未及详考，缺省起行年：太初元年
		["", 1, 0, ["除夕", "除夕，除夜"]],
		["", 1, 1, ["元日", "元日，元旦，春节"]],
		["", 1,15, ["上元节", "上元节，元宵节"]],
		["", 2, 2, ["龙抬头", "龙抬头"]],
		["", 2,15, ["花朝节", "百花朝，花朝节"]],
		["", 3, 3, ["上巳节", "三月三，上巳节"]],
		["", 5, 5, ["端午节", "端午节，端阳节"]],
		["", 7, 7, ["七夕节", "七夕节，乞巧节"]],
		["", 7,15, ["中元节", "中元节"]],
		["", 8,15, ["中秋节", "中秋节"]],
		["", 9, 9, ["重阳节", "重阳节"]],
		["",10,15, ["下元节", "下元节"]],
		["",12, 8, ["腊八节", "腊八节"]],
		[4420,12,23, ["北方小年", "北方小年"]],
		["",12,24, ["小年", "交年节，小年夜，祭灶，送灶神"]]
	],
	"JL": [
	],
	"WC": [ //: 参考《全国年节及纪念日放假办法》（西元2024年第四次修订版）
		[1925, 3, 8, ["妇女节", "国际劳动妇女节"]],
		[1979, 3,12, ["植树节", "植树节"]],
		[1920, 5, 1, ["劳动节", "五一国际劳动节"]],
		[1939, 5, 4, ["青年节", "五四青年节"]],
		[1912, 5,12, ["护士节", "国际护士节"]],
		[1950, 6, 1, ["儿童节", "六一国际儿童节"]],
		[1933, 8, 1, ["建军节", "中国人民解放军建军纪念日"]],
		[1985, 9,10, ["教师节", "教师节"]],
		[1950,10, 1, ["国庆节", "中华人民共和国国庆日"]],
		[2000,11, 8, ["记者节", "中国记者节"]]
	]
};
